docs/load-test/results/s5on-r3-k6-stdout.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: s2-inventory-sustained.js
        output: -

     scenarios: (100.00%) 2 scenarios, 500 max VUs, 1m22s max duration (incl. graceful stop):
              * warmup: 50.00 iterations/s for 30s (maxVUs: 50-100, exec: warmup, gracefulStop: 30s)
              * sustained: 300.00 iterations/s for 20s (maxVUs: 200-400, startTime: 32s, gracefulStop: 30s)

time="2026-08-16T21:42:36+09:00" level=info msg="[S2/S5] roomType=1 date=2026-09-12 stock=100 load=300/s x 20s" source=console

running (0m01.0s), 000/250 VUs, 49 complete and 0 interrupted iterations
warmup      [   3% ] 000/050 VUs  01.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      31.0s     

running (0m02.0s), 000/250 VUs, 99 complete and 0 interrupted iterations
warmup      [   7% ] 000/050 VUs  02.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      30.0s     

running (0m03.0s), 000/250 VUs, 149 complete and 0 interrupted iterations
warmup      [  10% ] 000/050 VUs  03.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      29.0s     

running (0m04.0s), 001/250 VUs, 198 complete and 0 interrupted iterations
warmup      [  13% ] 001/050 VUs  04.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      28.0s     

running (0m05.0s), 001/250 VUs, 248 complete and 0 interrupted iterations
warmup      [  17% ] 001/050 VUs  05.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      27.0s     

running (0m06.0s), 000/250 VUs, 299 complete and 0 interrupted iterations
warmup      [  20% ] 000/050 VUs  06.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      26.0s     

running (0m07.0s), 001/250 VUs, 348 complete and 0 interrupted iterations
warmup      [  23% ] 001/050 VUs  07.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      25.0s     

running (0m08.0s), 001/250 VUs, 398 complete and 0 interrupted iterations
warmup      [  27% ] 001/050 VUs  08.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      24.0s     

running (0m09.0s), 000/250 VUs, 449 complete and 0 interrupted iterations
warmup      [  30% ] 000/050 VUs  09.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      23.0s     

running (0m10.0s), 001/250 VUs, 498 complete and 0 interrupted iterations
warmup      [  33% ] 001/050 VUs  10.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      22.0s     

running (0m11.0s), 000/250 VUs, 549 complete and 0 interrupted iterations
warmup      [  37% ] 000/050 VUs  11.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      21.0s     

running (0m12.0s), 000/250 VUs, 599 complete and 0 interrupted iterations
warmup      [  40% ] 000/050 VUs  12.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      20.0s     

running (0m13.0s), 001/250 VUs, 648 complete and 0 interrupted iterations
warmup      [  43% ] 001/050 VUs  13.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      19.0s     

running (0m14.0s), 000/250 VUs, 699 complete and 0 interrupted iterations
warmup      [  47% ] 000/050 VUs  14.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      18.0s     

running (0m15.0s), 000/250 VUs, 749 complete and 0 interrupted iterations
warmup      [  50% ] 000/050 VUs  15.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      17.0s     

running (0m16.0s), 001/250 VUs, 798 complete and 0 interrupted iterations
warmup      [  53% ] 001/050 VUs  16.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      16.0s     

running (0m17.0s), 001/250 VUs, 848 complete and 0 interrupted iterations
warmup      [  57% ] 001/050 VUs  17.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      15.0s     

running (0m18.0s), 000/250 VUs, 899 complete and 0 interrupted iterations
warmup      [  60% ] 000/050 VUs  18.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      14.0s     

running (0m19.0s), 001/250 VUs, 948 complete and 0 interrupted iterations
warmup      [  63% ] 001/050 VUs  19.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      13.0s     

running (0m20.0s), 001/250 VUs, 998 complete and 0 interrupted iterations
warmup      [  67% ] 001/050 VUs  20.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      12.0s     

running (0m21.0s), 000/250 VUs, 1049 complete and 0 interrupted iterations
warmup      [  70% ] 000/050 VUs  21.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      11.0s     

running (0m22.0s), 001/250 VUs, 1098 complete and 0 interrupted iterations
warmup      [  73% ] 001/050 VUs  22.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      10.0s     

running (0m23.0s), 001/250 VUs, 1148 complete and 0 interrupted iterations
warmup      [  77% ] 001/050 VUs  23.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      09.0s     

running (0m24.0s), 000/250 VUs, 1199 complete and 0 interrupted iterations
warmup      [  80% ] 000/050 VUs  24.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      08.0s     

running (0m25.0s), 001/250 VUs, 1248 complete and 0 interrupted iterations
warmup      [  83% ] 001/050 VUs  25.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      07.0s     

running (0m26.0s), 001/250 VUs, 1298 complete and 0 interrupted iterations
warmup      [  87% ] 001/050 VUs  26.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      06.0s     

running (0m27.0s), 000/250 VUs, 1349 complete and 0 interrupted iterations
warmup      [  90% ] 000/050 VUs  27.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      05.0s     

running (0m28.0s), 000/250 VUs, 1399 complete and 0 interrupted iterations
warmup      [  93% ] 000/050 VUs  28.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      04.0s     

running (0m29.0s), 001/250 VUs, 1448 complete and 0 interrupted iterations
warmup      [  97% ] 001/050 VUs  29.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      03.0s     

running (0m30.0s), 000/250 VUs, 1499 complete and 0 interrupted iterations
warmup      [ 100% ] 000/050 VUs  30.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      02.0s     

running (0m31.0s), 000/250 VUs, 1500 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s  50.00 iters/s
sustained • [   0% ] waiting      01.0s

running (0m32.0s), 000/250 VUs, 1500 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s  50.00 iters/s
sustained • [   0% ] waiting      00.0s

running (0m33.0s), 016/250 VUs, 1773 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [   5% ] 016/200 VUs  01.0s/20s  300.00 iters/s

running (0m34.0s), 012/250 VUs, 2077 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  10% ] 012/200 VUs  02.0s/20s  300.00 iters/s

running (0m35.0s), 014/250 VUs, 2375 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  15% ] 014/200 VUs  03.0s/20s  300.00 iters/s

running (0m36.0s), 011/250 VUs, 2678 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  20% ] 011/200 VUs  04.0s/20s  300.00 iters/s

running (0m37.0s), 016/250 VUs, 2973 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  25% ] 016/200 VUs  05.0s/20s  300.00 iters/s

running (0m38.0s), 024/250 VUs, 3265 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  30% ] 024/200 VUs  06.0s/20s  300.00 iters/s

running (0m39.0s), 012/250 VUs, 3577 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  35% ] 012/200 VUs  07.0s/20s  300.00 iters/s

running (0m40.0s), 015/250 VUs, 3874 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  40% ] 015/200 VUs  08.0s/20s  300.00 iters/s

running (0m41.0s), 036/250 VUs, 4154 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  45% ] 036/200 VUs  09.0s/20s  300.00 iters/s

running (0m42.0s), 057/250 VUs, 4432 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  50% ] 057/200 VUs  10.0s/20s  300.00 iters/s

running (0m43.0s), 015/250 VUs, 4774 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  55% ] 015/200 VUs  11.0s/20s  300.00 iters/s

running (0m44.0s), 009/250 VUs, 5080 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  60% ] 009/200 VUs  12.0s/20s  300.00 iters/s

running (0m45.0s), 013/250 VUs, 5376 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  65% ] 013/200 VUs  13.0s/20s  300.00 iters/s

running (0m46.0s), 018/250 VUs, 5671 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  70% ] 018/200 VUs  14.0s/20s  300.00 iters/s

running (0m47.0s), 018/250 VUs, 5971 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  75% ] 018/200 VUs  15.0s/20s  300.00 iters/s

running (0m48.0s), 010/250 VUs, 6279 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  80% ] 010/200 VUs  16.0s/20s  300.00 iters/s

running (0m49.0s), 011/250 VUs, 6578 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  85% ] 011/200 VUs  17.0s/20s  300.00 iters/s

running (0m50.0s), 012/250 VUs, 6877 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  90% ] 012/200 VUs  18.0s/20s  300.00 iters/s

running (0m51.0s), 008/250 VUs, 7181 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  95% ] 008/200 VUs  19.0s/20s  300.00 iters/s

running (0m52.0s), 014/250 VUs, 7475 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [ 100% ] 014/200 VUs  20.0s/20s  300.00 iters/s
time="2026-08-16T21:43:28+09:00" level=info msg="[S2/S5] 날짜 2026-09-12, 초기 재고 100." source=console
time="2026-08-16T21:43:28+09:00" level=info msg="[S2/S5] verify/s2.sql 로 확인: 활성 예약 = 재고, 잔여 = 0, remaining<0 0건" source=console
time="2026-08-16T21:43:28+09:00" level=info msg="[S5 대조] 락 OFF에서도 성공이 정확히 재고 수여야 한다. 2차 방어선(조건부 UPDATE)의 증명이다." source=console
time="2026-08-16T21:43:28+09:00" level=info msg="[S5 대조] 초과 판매가 나오면 F04의 실패가 아니라 발견이다. 즉시 보고할 것." source=console

     ✓ 5xx 아님
     ✓ 400 아님
     ✓ 성공이거나 정중한 거절

   ✓ bad_request....................: 0       0/s
     checks.........................: 100.00% 18000 out of 18000
     data_received..................: 1.9 MB  36 kB/s
     data_sent......................: 2.0 MB  38 kB/s
     dur_created....................: avg=84.09ms  min=4.39ms   med=62.51ms  max=223.59ms p(90)=181.92ms p(95)=201.51ms p(99)=223.53ms
     dur_lock_failed................: avg=239.32ms min=191.62ms med=204.04ms max=516.22ms p(90)=337.56ms p(95)=385.01ms p(99)=477.13ms
     dur_rej_inventory..............: avg=44.57ms  min=2.39ms   med=26.46ms  max=504.52ms p(90)=116.09ms p(95)=155.36ms p(99)=214.41ms
   ✓ forbidden_transition_passed....: 0       0/s
     http_req_blocked...............: avg=17.75µs  min=1µs      med=2µs      max=7.34ms   p(90)=12µs     p(95)=18µs     p(99)=407µs   
     http_req_connecting............: avg=11.28µs  min=0s       med=0s       max=2.48ms   p(90)=0s       p(95)=0s       p(99)=359.03µs
     http_req_duration..............: avg=51.08ms  min=558µs    med=16.98ms  max=516.22ms p(90)=174.19ms p(95)=202.75ms p(99)=326.55ms
       { expected_response:true }...: avg=7.41ms   min=558µs    med=2.29ms   max=223.59ms p(90)=4.35ms   p(95)=16.72ms  p(99)=167.56ms
     ✓ { phase:main }...............: avg=63.28ms  min=2.39ms   med=27.87ms  max=516.22ms p(90)=195.07ms p(95)=210.7ms  p(99)=342.67ms
     http_req_failed................: 78.66%  5900 out of 7500
     http_req_receiving.............: avg=31.19µs  min=7µs      med=16µs     max=3.76ms   p(90)=77µs     p(95)=101µs    p(99)=149µs   
     http_req_sending...............: avg=16.73µs  min=3µs      med=9µs      max=2.48ms   p(90)=36µs     p(95)=47µs     p(99)=77µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=51.04ms  min=494µs    med=16.94ms  max=516.1ms  p(90)=174.15ms p(95)=202.67ms p(99)=326.51ms
     http_reqs......................: 7500    143.960464/s
     ✓ { phase:main }...............: 6000    115.168371/s
     iteration_duration.............: avg=51.26ms  min=630.16µs med=17.09ms  max=516.45ms p(90)=174.32ms p(95)=203ms    p(99)=326.74ms
     iterations.....................: 7500    143.960464/s
     lock_failed....................: 556     10.672269/s
   ✓ not_found......................: 0       0/s
     rej_inventory..................: 5344    102.576629/s
   ✓ rsv_created....................: 100     1.919473/s
   ✓ server_error...................: 0       0/s
   ✓ unknown_rejection..............: 0       0/s
     vus............................: 14      min=0              max=56 
     vus_max........................: 250     min=250            max=250


running (0m52.1s), 000/250 VUs, 7500 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s  50.00 iters/s
sustained ✓ [ 100% ] 000/200 VUs  20s  300.00 iters/s